{
  "audio": "Аудио-тренажер",
  "text": "Текстовый тренажер",
  "test": "Тестирование",
  "translate": "Переводчик",
  "about": "О курсе",
  "developers": "Разработчики",
  "notFound": "Упс, что-то пошло не так :(",
  "failedToken": "Время сеанса истекло. Авторизуйтесь, чтобы продолжить",
  "decode": "морзе -> текст",
  "encode": "текст -> морзе",
  "start": {
    "title": "Добро пожаловать <1 /> на интерактивный курс изучения азбуки <3>Морзе</3>!",
    "description": "Нажмите, чтобы войти или присоединиться",
    "logIn": "Войти",
    "signUp": "Регистрация",
    "backBtn": "Назад",
    "email": "Почта",
    "name": "Имя",
    "password": "Пароль",
    "confirmPassword": "Подтвердите пароль"
  },
  "home": {
    "question1": "Как дела, <1>{{name}}</1>?",
    "question2": "Чем займемся сегодня?"
  },
  "tutorial": {
    "0": {
      "description": "Добро пожаловать, {{name}}! Меня зовут <3>Мяус</3>, я буду рад помогать тебе на курсе",
      "btn": "Привет, Мяус!"
    },
    "1": {
      "description": "Кликнув на свое имя рядом с аватаркой ты сможешь посмотреть свои достижения, сменить свои данные. Обязательно попробуй выбрать аватарку!",
      "btn": "Хорошо"
    },
    "2": {
      "description": "На панели слева ты можешь выбрать раздел и начать обучение. Предлагаю начать с тренажера!",
      "btn": "Хорошо"
    }
  },
  "translator": {
    "placeholder": "Введите текст для перевода...",
    "translate": "Перевести",
    "reset": "Сбросить"
  },
  "testing": {
    "description": "Вижу, ты уже готов испытать себя! За успешное прохождение этого раздела я тебя награжу. Твоя задача разгадать шифр: прослушай код Морзе (каждая буква разделена небольшой паузой) и введи расшифровку (буквы без пробелов) в текстовое поле внизу",
    "placeholder": "Введи сюда расшифровку...",
    "error": "*вводи только кириллицу (а-я)",
    "winner": "Поздравляю, <1>{{name}}</1>, с успешным прохождением курса по изучению азбуки Морзе! Награждаю тебя сертификатом, который я уже положил в твой профиль, ты можешь скачать его и распечатать",
    "looser": "Твой результат {{score}}%, а для успешного прохождения тестирования необходимо набрать 100%. Попробуй наши тренажёры, чтобы подготовится лучше и возвращайся снова!",
    "againBtn": "Заново!",
    "toProfile": "Перейти в профиль"
  },
  "lesson": {
    "select": "Урок {{id}}",
    "status": {
      "0": "Урок не завершён",
      "1": "Урок завершён (лучший счет - {{completedScore}})"
    },
    "task": "Задание:"
  },
  "game": {
    "title": "Мини-игра",
    "score": "Счет: {{score}}",
    "end": "Игра завершена",
    "again": "Попробовать еще!",
    "warning": "Прежде чем ты начнешь играть, позволь объяснить тебе некоторые правила",
    "rules": {
      "0": "Тебе будет предложено несколько вопросов, твоя задача - выбрать правильный ответ",
      "1": "Каждый правильный ответ дает тебе 10 очков, неправильный не дает ничего",
      "2": "На все вопросы у тебя есть всего 4 минутки, так что не оплошай!"
    },
    "start": "Погнали!"
  },
  "winner": {
    "description": {
      "0": "Упс... В этот раз не удалось, но я помню о твоем лучшем счете как и обещал - {{bestScore}}! Можешь попробовать еще раз и у тебя обязательно получится! А пока можешь попробовать следующий урок :)",
      "1": "Поздравляю, ты прошел урок {{lessonID}}! Сейчас ты набрал {{currentScore}} очков! Пройти уровень ты можешь повторно, но я помню только твой лучший результат - {{bestScore}} :)"
    },
    "nextBtn": {
      "usual": "Следующий урок!",
      "lastLesson": "В начало!"
    }
  },
  "looser": {
    "description": "Точность меньше 70%, придется пройти урок № {{lessonID}} еще раз. Не расстраивайся, у меня тоже лапки!",
    "againBtn": "Заново!"
  },
  "aboutPage": {
    "title-1": "О курсе",
    "block1-title": "Что такое азбука Морзе?",
    "block1-span": "Азбука Морзе (Код Морзе, Морзянка) - способ кодирования знаков последовательностью звуковых сигналов по определенным правилам. Код позволяет кодировать цифры, буквы, знаки пунктуации, служебные символы посредством длинных сигналов (тире) и коротких (точек).",
    "block2": "Идея кодирования принадлежит Сэмюэлю Морзе; кодирование букв и цифр осуществил его коллега, Альфред Вейлор. Позже Фридрих Герке код усовершенствовал до международного телеграфного. Первое сообщение было отправлено в мае 1844 года между Вашингтоном и Балтимором с текстом “Вот что творит бог”.",
    "block3-1": "для кодирования используются два звуковых сигнала: длинный (тире) и короткий (точка);",
    "block3-2": "за единицу времени принимается длительность короткого сигнала (одной точки);",
    "block3-3": "длительность тире равно длительности трём точкам;",
    "block3-4": "пауза между элементами одного знака — одна точка;",
    "block3-5": "пауза между знаками в слове — три точки;",
    "block3-6": "пауза между словами — семь точек.",
    "block4-title": "Особенности азбуки Морзе для русского алфавита:",
    "block4-1": "Русские буквы Е и Ё представлены одним кодом — точкой;",
    "block4-2": "Часто вместо твёрдого знака передают код мягкого знака;",
    "block4-3": "Некоторые буквы русского алфавита (Ш, Щ и другие) не имеют аналогов в английском языке, поэтому международная таблица расширена «русскими» вариантами.",
    "block5": "Цифры обозначаются 5 сигналами, где тире - отсутствие, а точка - присутствие еденицы числа. Таким образом 5 тире - это 0, а 5 точек - цифра 5. Числа от 1 до 5 обозначаются необходимым колличесвтом точек и заполнением тире пустот. А от шести - наоборот, сперва идет тире, как присутствие еденицы, пустоты заполняются точками. Для наглядности: три точки и две тире - 3; три тире и две точки - 8.",
    "block6": "Знаки препинания обозначаются шестью символами. Точка - 6 точек (вот такой вот каламбур). Запятая - чередование точки и тире. Знак вопроса - две точки, два тире, две точки.",
    "block7": "Код, который желательно знать каждому - сигнал просьбы о помощи - СОС. Его обозначение - три точки, три тире, три точки. Если Вы - радиолюбитель - не пытайтесь использовать его шутки ради!",
    "dev": "Разработчики",
    "jen": "Евгения",
    "kris": "Кристина",
    "xenia": "Ксения",
    "role1": "Тимлид",
    "role2": "Фронтенд-разработчик"
  },
  "account": {
    "name": "Имя",
    "score": "Общий счет: {{score}}",
    "sertificate": "Сертификат",
    "signOut": "Выйти",
    "getLeaders": "Посмотреть лидеров",
    "hideLeaders": "Скрыть лидеров"
  }
}
