[
  {
    "id": 1,
    "description": "Поздравляю с началом изучения азбуки Морзе! Это - аудио тренажер, твоя задача изучить звучание сигналов - в этом уроке для букв К и М, прослушать задание в плеере снизу и ввести расшифровку. Подсказка, в задании сигнал для 10 букв, вводи в правильной последовательности.",
    "symbols": ["к", "м"],
    "player": ["k", "m"],
    "task": "km",
    "answer": ["м", "к", "к", "м", "м", "м", "к", "м", "к", "к"],
    "score": 100
  },
  {
    "id": 2,
    "description": "В этом уроке твоя задача изучить звучание сигнала для буквы А, прослушать задание в плеере снизу и расшифровать записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["а"],
    "player": ["a"],
    "task": "a",
    "answer": ["а", "к", "м", "а", "а", "м", "к", "а", "к", "а"],
    "score": 100
  },
  {
    "id": 3,
    "description": "В этом уроке буква для изучения - У. Прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["у"],
    "player": ["u"],
    "task": "u",
    "answer": ["к", "у", "у", "м", "а", "у", "к", "м", "а", "у"],
    "score": 100
  },
  {
    "id": 4,
    "description": "Теперь изучи как звучит в Морзе буква С. А после прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["с"],
    "player": ["s"],
    "task": "s",
    "answer": ["с", "к", "у", "а", "с", "к", "а", "м", "с", "с"],
    "score": 100
  },
  {
    "id": 5,
    "description": "Следующая на очереди - буква Р. Изучи ее звучание в Морзе, а после прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["р"],
    "player": ["r"],
    "task": "r",
    "answer": ["р", "р", "у", "к", "р", "а", "с", "р", "м", "а"],
    "score": 100
  },
  {
    "id": 6,
    "description": "Сейчас в плеере для изучения сигнал буквы Т. Как изучишь - прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["т"],
    "player": ["t"],
    "task": "t",
    "answer": ["у", "т", "т", "м", "к", "т", "с", "р", "а", "р"],
    "score": 100
  },
  {
    "id": 7,
    "description": "Настало время познакомится с буквой О. Прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы, как будешь готов. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["о"],
    "player": ["o"],
    "task": "o",
    "answer": ["о", "о", "к", "у", "т", "о", "м", "о", "р", "с"],
    "score": 100
  },
  {
    "id": 8,
    "description": "Отличный темп! Время для Н! Изучи сигнал, а после прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["н"],
    "player": ["n"],
    "task": "n",
    "answer": ["н", "а", "к", "р", "о", "с", "м", "у", "т", "н"],
    "score": 100
  },
  {
    "id": 9,
    "description": "Вот оно - упорство! Буква Х тебя ждет, когда изучишь - прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["х"],
    "player": ["h"],
    "task": "h",
    "answer": ["х", "о", "т", "к", "н", "у", "с", "р", "а", "х"],
    "score": 100
  },
  {
    "id": 10,
    "description": "Чуть не пропустили столь важную букву В. Сперва изучи ее, а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["в"],
    "player": ["w"],
    "task": "w",
    "answer": ["в", "о", "с", "а", "у", "н", "м", "х", "х", "в"],
    "score": 100
  },
  {
    "id": 11,
    "description": "Новый урок - новая буква. На этот раз изучить предстоит Е. Потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["е"],
    "player": ["e"],
    "task": "e",
    "answer": ["е", "в", "х", "к", "м", "с", "у", "а", "в", "е"],
    "score": 100
  },
  {
    "id": 12,
    "description": "Новая буква на этом уроке - это И. После изучения прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["и"],
    "player": ["i"],
    "task": "i",
    "answer": ["и", "е", "р", "с", "у", "в", "х", "а", "н", "и"],
    "score": 100
  },
  {
    "id": 13,
    "description": "После урока и буква Д появится в твоем арсенале. Только сперва изучи ее, а после прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["д"],
    "player": ["d"],
    "task": "d",
    "answer": ["д", "а", "н", "и", "в", "у", "м", "т", "с", "д"],
    "score": 100
  },
  {
    "id": 14,
    "description": "Буква Г на барабане! Ой, то есть на экране! Запомни, а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["г"],
    "player": ["g"],
    "task": "g",
    "answer": ["г", "м", "к", "в", "г", "и", "д", "у", "х", "с"],
    "score": 100
  },
  {
    "id": 15,
    "description": "Пришла пора для новой буквы - Л. Запомни, а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["л"],
    "player": ["l"],
    "task": "l",
    "answer": ["и", "г", "л", "х", "д", "в", "л", "и", "т", "а"],
    "score": 100
  },
  {
    "id": 16,
    "description": "Ого, да ты уже прошел половину пути! Новая буква П для тебя. Прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["п"],
    "player": ["p"],
    "task": "p",
    "answer": ["х", "п", "о", "л", "с", "к", "а", "п", "г", "в"],
    "score": 100
  },
  {
    "id": 17,
    "description": "Как правильно пишется - Фторник или Фторнек? На Ф не только фуфайка, но и новая буква. Расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["ф"],
    "player": ["f"],
    "task": "f",
    "answer": ["а", "п", "ф", "ф", "х", "р", "л", "г", "о", "е"],
    "score": 100
  },
  {
    "id": 18,
    "description": "Новая буква это З. Запомни, а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["з"],
    "player": ["z"],
    "task": "z",
    "answer": ["з", "м", "к", "г", "л", "у", "х", "ф", "п", "з"],
    "score": 100
  },
  {
    "id": 19,
    "description": "Пора знакомится и с буквой Ж! Сперва изучи, а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["ж"],
    "player": ["v"],
    "task": "v",
    "answer": ["е", "ж", "х", "о", "р", "ж", "з", "н", "ф", "а"],
    "score": 100
  },
  {
    "id": 20,
    "description": "Вот уже и треть позади! Запомни букву Б, а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["б"],
    "player": ["b"],
    "task": "b",
    "answer": ["ф", "х", "б", "з", "р", "м", "б", "к", "п", "ж"],
    "score": 100
  },
  {
    "id": 21,
    "description": "Буква Щ! Ты точно сможешь ее изучить, а потом прослушать задание в плеере снизу и расшифровать записанный сигнал на изученные ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["щ"],
    "player": ["q"],
    "task": "q",
    "answer": ["б", "з", "у", "щ", "а", "п", "с", "ж", "щ", "ф"],
    "score": 100
  },
  {
    "id": 22,
    "description": "В этом уроке твоя задача изучить звучание сигнала для буквы Ц, прослушать задание в плеере снизу и расшифровать записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["ц"],
    "player": ["c"],
    "task": "c",
    "answer": ["ц", "ц", "м", "к", "щ", "р", "х", "ж", "б", "п"],
    "score": 100
  },
  {
    "id": 23,
    "description": "Следующая на очереди - буква Ы. Изучи ее звучание в Морзе, а после прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["ы"],
    "player": ["y"],
    "task": "y",
    "answer": ["е", "ц", "х", "ы", "ж", "в", "ы", "и", "с", "д"],
    "score": 100
  },
  {
    "id": 24,
    "description": "После урока даже буква Й появится в твоем арсенале. Только сперва изучи ее, а после прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["й"],
    "player": ["j"],
    "task": "j",
    "answer": ["щ", "х", "й", "у", "й", "в", "н", "к", "ы", "и"],
    "score": 100
  },
  {
    "id": 25,
    "description": "Мы на финишной черте, а значит пора узнать букву Ь. После прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["ь"],
    "player": ["x"],
    "task": "x",
    "answer": ["ь", "й", "б", "д", "о", "ь", "т", "х", "ц", "ы"],
    "score": 100
  },
  {
    "id": 26,
    "description": "Я - последняя буква в алфавите! Но у нас другой черед :) Запомни, а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["я"],
    "player": ["ia"],
    "task": "ia",
    "answer": ["ь", "х", "я", "м", "р", "е", "й", "и", "я", "т"],
    "score": 100
  },
  {
    "id": 27,
    "description": "Ш - новый хит сезона! Ты знаешь, что делать, но напомню: прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["ш"],
    "player": ["sh"],
    "task": "sh",
    "answer": ["я", "с", "ц", "в", "ш", "к", "у", "б", "н", "ш"],
    "score": 100
  },
  {
    "id": 28,
    "description": "Уже сбился со счета, каким буквам тебя еще не научил... Точно, Ч! Запомни, а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["ч"],
    "player": ["che"],
    "task": "che",
    "answer": ["м", "ч", "ш", "р", "я", "ч", "о", "д", "ц", "б"],
    "score": 100
  },
  {
    "id": 29,
    "description": "Буква Ю - это то, что я люблю! Что, не эту рифму ждал? Ну-ка, запоминай а потом прослушай задание в плеере снизу и расшифруй записанный сигнал на изученные тобой ранее буквы. Подсказка: в задании сигнал для 10 букв.",
    "symbols": ["ю"],
    "player": ["iu"],
    "task": "iu",
    "answer": ["ч", "ь", "н", "ю", "ш", "й", "ц", "ю", "б", "я"],
    "score": 100
  },
  {
    "id": 30,
    "description": "Ура, финал! Напоследок изучи-ка букву Э. Запомнил? Что же, мне тебя учить больше нечему, ученик-кун. Расшифруй финальное задание! Помни, ты всегда можешь вернуться на тропу знаний, я буду снова ждать тебя, ученик-кун! Мур :)",
    "symbols": ["э"],
    "player": ["ae"],
    "task": "ae",
    "answer": ["ю", "э", "ч", "ш", "м", "э", "к", "я", "с", "й"],
    "score": 100
  }
]
