[
  {
    "id": 1,
    "description": "Привет! Вот ты и добрался до нашего отличного текстового тренажёра! В этом уроке изучим код двух самых часто встречающихся букв - К и М. Твоя задача запомнить их визуальный код. Когда будешь готов, обрати внимание на панель с текстом снизу и введи шифр в необходимые поля (помни, что каждой букве нужен свой домик). В качестве символов используй \"-\" обычное тире(минус) и \".\" - точку. Для того чтобы получить результат, нужно заполнить все поля. Каждое поле - буква из задания (не волнуйся, все идет по порядку). Можешь приступать, а я пока помурчу.",
    "symbols": ["к", "м"],
    "code": ["-.-", "--"],
    "task": "ккмккмккмк",
    "answer": ["-.-", "-.-", "--", "-.-", "-.-", "--", "-.-", "-.-", "--", "-.-"],
    "score": 100
  },
  {
    "id": 2,
    "description": "Ау-ау-ау, я тебя всё равно найду... Ой, ты уже тут :) Ну что же, теперь на очереди буква А, она тоже довольно популярна, как и ваш покорный слуга. Не забудь, что К и М ты уже знаешь (если не очень, то ты всегда можешь вернуться к уроку 1) Правила все те же: познакомься с кодом для буквы, а затем выполни упражнение внизу. И помни, для получения результата необходимо заполнить все поля, а в качестве символов используй \"-\" тире(минус) и \".\" точку. Удачи, буду ждать :)",
    "symbols": ["а"],
    "code": [".-"],
    "task": "кмаамккмка",
    "answer": ["-.-", "--", ".-", ".-", "--", "-.-", "-.-", "--", "-.-", ".-"],
    "score": 100
  },
  {
    "id": 3,
    "description": "Моё уважение твоему интересу к азбуке Мурзе. На сегодня я подготовил ещё одну занятную букву - У. Теперь, зная букву А, тебе не нужно будет кричать в лесу \"Аууууу\", если потеряешься. Так можно и медведя, знаете ли, привлечь. Теперь сможешь передавать сигнал \"АУ\" с помощью азбуки Морзе. Правда, понадобится телеграф и радио... Но это уже совсем другая история. Ничто не вечно, кроме правил нашего тренажера: запомни новый код для буквы и покажи свою мощь, выполнив упражнение внизу. Для того чтобы получить результат, заполни все-все поля, используй \"-\" тире(минус) и \".\" точку. Я всегда тут, если нужна помощь.",
    "symbols": ["у"],
    "code": ["..-"],
    "task": "камуукмауу",
    "answer": ["-.-", ".-", "--", "..-", "..-", "-.-", "--", ".-", "..-", "..-"],
    "score": 100
  },
  {
    "id": 4,
    "description": "Супер, ты уже на 4 уроке, а всего их 32. Блин, кажется я не умею подбадривать :( Наш символ на этот урок - С. Сколько хороших слов начинается с этой буквы: сметана, сыровяленая колбаса... Что делать, ты уже знаешь: запомни символ и выполни упражнение ниже. Очень важно: в качестве символов используй \"-\" тире(минус) и \".\" точку, а также помни, чтобы заработать баллы, нужно заполнить все поля без единого пропуска! А я пошел есть колбасу. Мурдачи тебе! (только не справляйся быстро, пожалуйста, дай мне насладится колбасой!)",
    "symbols": ["с"],
    "code": ["..."],
    "task": "кссмаууксс",
    "answer": ["-.-", "...", "...", "--", ".-", "..-", "..-", "-.-", "...", "..."],
    "score": 100
  },
  {
    "id": 5,
    "description": "Итак, сегодня на нашем учебном столе изысканное блюдо от шефа Гордона Мурзе - символ Р. Не сомневаюсь, что ты уже опытный повар нашей кухни, но напоминаю, твоя задача выполнить упражнение внизу, предварительно запомнив новый символ. В нашем ресторане принято заполнять все пустые тарелки (поля), и использовать для этого не что попало, а \"-\" тире(минус) и \".\" точку. Ответ отправляется автоматически, а правильные и ошибочные поля подсвечиваются. Докажи, что ты достойный ученик Гордона Мурзе и выполни это упражнение :)",
    "symbols": ["р"],
    "code": [".-."],
    "task": "ррмауррмау",
    "answer": [".-.", ".-.", "--", ".-", "..-", ".-.", ".-.", "--", ".-", "..-"],
    "score": 100
  },
  {
    "id": 6,
    "description": "Всего 6 урок, а я уже устал... Как ты справляешься? Я не пойму... А ну да, я же постоянно повторяю правила, замотался уже, наверное... Тук-тук, это буква Т пришла! Ну что ж, разберешься? А я котик и у меня лапки, поэтому я пойду отдыхать :). Разберись с буквой Т, выполнив упражнение внизу. Обязательно используй \"-\" тире(минус) и \".\" точку, и заполни все поля до единого - только так можно получить свои заветные баллы. Мы тут отрицаем кнопки, поэтому ответ на проверку отправится автоматически.",
    "symbols": ["т"],
    "code": ["-"],
    "task": "стукрамакараскуткум",
    "answer": [
      "...",
      "-",
      "..-",
      "-.-",
      ".-.",
      ".-",
      "--",
      ".-",
      "-.-",
      ".-",
      ".-.",
      ".-",
      "...",
      "-.-",
      "..-",
      "-",
      "-.-",
      "..-",
      "--"
    ],
    "score": 100
  },
  {
    "id": 7,
    "description": "Ого, а вот и буква О. Не ожидал ее здесь увидеть, как и не ожидал, что опять мне придется повторять правила. Чего не сделаешь для любимого ученика :) Итак, познакомься с буквой О, тут всего 3 тире, так что знакомство будет коротким. Вспомни, что мы уже изучили буквы К, М, Р, и Т! Выполни упражнение, заполнив все поля. Для этого используй \"-\" тире(минус) и \".\" точку. Нажимать ничего не нужно: как только заполнишь все поля, ответ отправится на проверку автоматически.",
    "symbols": ["о"],
    "code": ["---"],
    "task": "тоокротсом",
    "answer": ["-", "---", "---", "-.-", ".-.", "---", "-", "...", "---", "--"],
    "score": 100
  },
  {
    "id": 8,
    "description": "В темном городе Н. сегодня дождливо. По его тихим улицам, в полутьме, застилающей его пространство, буква Н пробирается к нашему ученику. Он ничего, не подозревает, играется с его старыми друзьями: буквами А, М, У, К, Р, Т, С и О. Буква Н тихими шагами подкрадывается со спины, она дышит в затылок нашего ученика, еще секунда и... Она набрасывается на него с криками: \"Выполни упражнение!!!\". Ученик растерян, но он знает, что делать. А я лишь напомню: чтобы победить этого монстра, заполни все предложенные поля, используя \"-\" тире(минус) и \".\" точку. Кто же победит в этой схватке? Узнаем, когда справишься...",
    "symbols": ["н"],
    "code": ["-."],
    "task": "тоннаконта",
    "answer": ["-", "---", "-.", "-.", ".-", "-.-", "---", "-.", "-", ".-"],
    "score": 100
  },
  {
    "id": 9,
    "description": "О, боже кто это печальный дядя? - Я Шерлок Холмс, вернее я им был раньше. Буква Х покинула меня, и теперь я жалкий Шерлок олмс... Блин, звучит действительно печально, думаю надо найти эту беглую паразитку и укротить её нрав с помощью упражнения. В этом помогут \"-\" тире(минус) и \".\" точка, но используй их с умом. Необходимо заполнить все поля, чтобы получить баллы и завершить урок (ответ отправится автоматически). Поможешь несчастному Шерлоку олмсу вновь стать Холмсом?",
    "symbols": ["х"],
    "code": ["...."],
    "task": "хаханаххан",
    "answer": ["....", ".-", "....", ".-", "-.", ".-", "....", "....", ".-", "-."],
    "score": 100
  },
  {
    "id": 10,
    "description": "На прошлом уроке ты сделал доброе дело - помог Шерлоку снова стать Холмсом, но в твоей помощи нуждается его друг - Доктор атсон (ранее Ватсон). Помоги и ему вернуть былую славу. Чтобы это осуществить - выполни упражнение, заполнив все поля. Разрешено использовать \"-\" тире(минус) и \".\" точку. Ответ отправится автоматически, как только справишься со всеми полями. Верно и неверно заполненные поля выделяются цветами. Мурдачи!",
    "symbols": ["в"],
    "code": [".--"],
    "task": "вукхаввамт",
    "answer": [".--", "..-", "-.-", "....", ".-", ".--", ".--", ".-", "--", "-"],
    "score": 100
  },
  {
    "id": 11,
    "description": "После такой заварушки из  10 уроков, давай немного отдохнем. Учится все равно, конечно, надо. Я выбрал для тебя простую букву - Е. Она, конечно, простая, но не забывай и о ранее изученных буквах. Как и всегда, для того чтобы не случилось беды, используй \"-\" тире(минус) и \".\" точку. Для того чтобы выполнить упражнение, необходимо заполнить все до одного поля, тогда ответ автоматически отправится и мы будем вместе радоваться завершенному уроку. Ты тут занимайся, а я пока немножко похраплю... Хррр-пфф...",
    "symbols": ["е"],
    "code": ["."],
    "task": "неетмахеек",
    "answer": ["-.", ".", ".", "-", "--", ".-", "....", ".", ".", "-.-"],
    "score": 100
  },
  {
    "id": 12,
    "description": "И-и-и, сектор приз на барабане! Назовите вашу букву! Ах, да, я же виртуальный котик и вас не услышу, так что назову сам (и приз тоже получу сам): буква И. У вас свой приз: знания и очки за пройденный урок. Мне мой приз достался легко, а вам все же придется выполнить упражнение. Помогу только тем, что напомню правила: используй \"-\" тире(минус) и \".\" точку, и заполни ими все пустующие поля (желательно верно)! Каждое поле - буква из задания, и необходимо заполнить их все, чтобы завершить урок. Все отправится автоматически, как закончишь, а я буду ждать с нетерпением.",
    "symbols": ["и"],
    "code": [".."],
    "task": "хмиирениук",
    "answer": ["....", "--", "..", "..", ".-.", ".", "-.", "..", "..-", "-.-"],
    "score": 100
  },
  {
    "id": 13,
    "description": "Какой чудесный день, какой чудесный пень, какой прекрасный я и буковка моя да-да. Итак, буква у вас перед глазами, решимость в сердце и знания в голове. Дерзайте! Когда дерзновение принесет свои плоды, заполни все пустые поля (каждое поле - буква задания). Повторение мать учения: используй \"-\" тире(минус) и \".\" точку. И мудрость напоследок: путь осилит мурчащий... Мур.",
    "symbols": ["д"],
    "code": ["-.."],
    "task": "двадомаход",
    "answer": ["-..", ".--", ".-", "-..", "---", "--", ".-", "....", "---", "-.."],
    "score": 100
  },
  {
    "id": 14,
    "description": "— Гена, мне очень сложно. И тяжело. Скажи что-нибудь утешающее. — Чебурашка, сегодня ты выучишь букву Г. Да, мне пришлось гуглить анекдоты про крокодила Гену и Чебурашку. Да, у меня уже заканчиваются идеи как оригинально напомнить правила. В общем ты знаешь, что делать, а если не знаешь, то посмотри любой другой урок - я там уже рассказал :) Главное, не забывай: чтобы получить баллы, нужно заполнить все поля (а каждое поле - буква задания), а в качестве символов необходимо использовать \"-\" тире(минус) и \".\" точку. Нажимать ни на что не надо - все отправляется автоматически, а я пошел читать анекдоты дальше. Господи, чем я занимаюсь...",
    "symbols": ["г"],
    "code": ["--."],
    "task": "гугехагенг",
    "answer": ["--.", "..-", "--.", ".", "....", ".-", "--.", ".", "-.", "--."],
    "score": 100
  },
  {
    "id": 15,
    "description": "Вот и половина пути. Ну почти. Все-таки я так и не научился подбадривать. Зато, я приготовил еще одну букву. Не научился подбадривать, зато научусь азбуке Мурзе. Наш гость буква Л - элегантная и утонченная дама. Нет, для того чтобы ее покорить, не надо мурчать серенады под окном в 3 часа ночи (этим занимаюсь только я), достаточно выполнить упражнение. Для этого заполни все поля (желательно правильными ответами), и помни одно поле = одна буква. Напоминаю, что символы, которые мы тут используем это \"-\" тире(минус) и \".\" точка. Ответ отправится автоматически, как только ты справишься. Пойду петь серенады под окнами человеков, вдруг они скинут мне колбасу...",
    "symbols": ["л"],
    "code": [".-.."],
    "task": "дуглламколл",
    "answer": ["-..", "..-", "--.", ".-..", ".-..", ".-", "--", "-.-", "---", ".-..", ".-.."],
    "score": 100
  },
  {
    "id": 16,
    "description": "Моя креативность в придумывании подсказок дошла до \"А почему бы не рассказать анекдот про Пупу и Лупу?\". Не заставляй меня совершать такую фатальную ошибку и выполни задание. Надеюсь, ты помнишь про используемые символы и необходимость заполнить все поля :) Если всё-таки память подводит, можешь посмотреть любой другой урок. Мурдачи тебе!",
    "symbols": ["п"],
    "code": [".--."],
    "task": "пловкоппму",
    "answer": [".--.", ".-..", "---", ".--", "-.-", "---", ".--.", ".--.", "--", "..-"],
    "score": 100
  },
  {
    "id": 17,
    "description": "Да, освоить букву Ф - это не фунт изюма съесть. Но, я верю в тебя, мой юный падаван. Помни, символы кроме \"-\" тире (минуса) и \".\" точки к темной силе двигают тебя Чтобы к светлой силе прийти, нужно поле все заполнить. Как сделаешь это, на проверку они отправятся и баллы ты получишь. Поле одно одной букве равнозначно. Да прибудет с тобою сила в постижении азбуки Мурзе!",
    "symbols": ["ф"],
    "code": ["..-."],
    "task": "уффтакплоф",
    "answer": ["..-", "..-.", "..-.", "-", ".-", "-.-", ".--.", ".-..", "---", "..-."],
    "score": 100
  },
  {
    "id": 18,
    "description": "Ай, какой молодец тут у нас! Столько всего прошел! Ну ничего тяжело в учении, легко в мурчании. Так как мы напарники, то я тебе помогу: мурчание я беру на себя, а изучение буквы З ты бери на себя. И не благодари! Краткая справка, что делать: букву - учить, упражнение - выполнять,   \".\" точки и \"-\" тире (минусы) - использовать, поля - заполнять!",
    "symbols": ["з"],
    "code": ["--.."],
    "task": "зуплуззмуз",
    "answer": ["--..", "..-", ".--.", ".-..", "..-", "--..", "--..", "--", "..-", "--.."],
    "score": 100
  },
  {
    "id": 19,
    "description": "Ну вот и настала буква Ж. Главное помнить, что из Ж всегда есть выход - закончить упражнение. Это осуществимо с помощью \".\" точки и \"-\" тире (минуса) и заполнения всех полей (каждое поле отвечает за одну букву из задания). Заполненные поля подсвечиваются цветами в зависимости от правильного или ошибочного заполнения. Нажимать специальных кнопок не надо - как только заполнишь поля, ответ отправится на проверку автоматически :)",
    "symbols": ["ж"],
    "code": ["...-"],
    "task": "жужажуетфи",
    "answer": ["...-", "..-", "...-", ".-", "...-", "..-", ".", "-", "..-.", ".."],
    "score": 100
  },
  {
    "id": 20,
    "description": "А и Б сидели на трубе. А мы изучили, И мы изучили, а Б пропала. Короче пустая труба теперь. Изучи букву Б и верни ее на трубу, а там глядишь, может и А подтянется. Не тормози, а все поля заполни! (каждое поле ответственно только за одну букву из предложенного задания). Чтобы их заполнить используй \".\" точку и \"-\" тире (минус). Задание отправится на проверку автоматически, как только заполнишь последнее поле. Пойду пока займусь любимым делом: потребую у кого-нибудь колбасы...",
    "symbols": ["б"],
    "code": ["-..."],
    "task": "лоббибубик",
    "answer": [".-..", "---", "-...", "-...", "..", "-...", "..-", "-...", "..", "-.-"],
    "score": 100
  },
  {
    "id": 21,
    "description": "Кто самый красивый и прекрасный? Правильно - Я! Ну, а если ты не ответил на этот вопрос с первого раза, то изучи букву Я. Напоминаю, чтобы завершить урок, нужно выполнить упражнение. Упражнение отправится на проверку автоматически, как только ты заполнишь все поля до единого. А чем их заполнять? Не смеши мои лапки, ты же знаешь, что нам подходят только \".\" точки и \"-\" тире (минусы). Вот так вот иногда со мной получается весело :) Я верю в то что ты справишься!",
    "symbols": ["я"],
    "code": [".-.-"],
    "task": "мояябляяко",
    "answer": ["--", "---", ".-.-", ".-.-", "-...", ".-..", ".-.-", ".-.-", "-.-", "---"],
    "score": 100
  },
  {
    "id": 22,
    "description": "Захвати штопор, я принес бутылочку своей самой лучшей валерьяночки! И помни, без буквы Ш штопор превращается в топор. Надеюсь, ты не забыл, что делать, потому что мне уже пора пойти балдеть. Но перед балдежом все же напомню: заполни все-все поля необходимыми \".\" точками и \"-\" тире (минусами), на одно поле приходится одна буква. Ну и как справишься, все отправится на проверку автоматически - тебе ничего не нужно делать :)",
    "symbols": ["ш"],
    "code": ["----"],
    "task": "шлаяпошаше",
    "answer": ["----", ".-..", ".-", ".-.-", ".--.", "---", "----", ".-", "----", "."],
    "score": 100
  },
  {
    "id": 23,
    "description": "Эта буква сестра предыдущей буквы Ш, но с косой подлиннее. Тебе всего-то нужно запомнить как эта красотка выглядит и попытаться выполнить упражнение. Чтобы справиться с этим заданием заполни все поля \".\" точками и \"-\" тире (минусами). Помни, что одно поле - одна буква (все поля идут в том же порядке, что и буквы в задании). Я верю, что эта попытка увенчается успехом :) Для приготовления успеха после того как заполнишь поля, ничего дела не нужно - наша автоматическая проверка сделает все за тебя.",
    "symbols": ["щ"],
    "code": ["--.-"],
    "task": "щукащупает",
    "answer": ["--.-", "..-", "-.-", ".-", "--.-", "..-", ".--.", ".-", ".", "-"],
    "score": 100
  },
  {
    "id": 24,
    "description": "Я знаю ты устал, но нашем пути осталось совсем немного букв. Наша сегодняшняя гостья редкая, но вместе с тем очень целеустремленная. Она долго пыталась попасть к нам на наш обучающий стол, но пробилась только сейчас - встречай неповторимую букву Ц!. Не обижай ее старания и выполни упражнение ниже (помни, что необходимо заполнить все поля нашими любимыми \".\" точками и \"-\" тире (минусами)). Когда закончишь, твой ответ отправится на оценку автоматически :)",
    "symbols": ["ц"],
    "code": ["-.-."],
    "task": "цветцибуля",
    "answer": ["-.-.", ".--", ".", "-", "-.-.", "..", "-...", "..-", ".-..", ".-.-"],
    "score": 100
  },
  {
    "id": 25,
    "description": "Чувствую себя на все 100. Конечно, ведь это не я делаю эти упражнения. Но если для тебя 100 цифра далекая от твоей оценки самочувствия, то дарю тебе букву Ч. Вдруг она подбавит чувств? Помни, задание отправляется на проверку (а итогом этого будут твои желанные баллы) только после того как ты заполнишь все поля. К 25 уроку я надеюсь ты помнишь, что используем мы только \".\" точки и \"-\" тире (минусы). Жду, когда и ты почувствуешь себя на все 100!",
    "symbols": ["ч"],
    "code": ["---."],
    "task": "чучундрачи",
    "answer": ["---.", "..-", "---.", "..-", "-.", "-..", ".-.", ".-", "---.", ".."],
    "score": 100
  },
  {
    "id": 26,
    "description": "Знаешь, вот с буквой Ы вообще нет никаких ассоциаций, поэтому давай по-быстрому выполним упражнение и забудем это как страшный сон. Я думаю, ты поймешь меня без слов, если я упомяну необходимость заполнить все поля. Мурдачи!",
    "symbols": ["ы"],
    "code": ["-.--"],
    "task": "сыырныряет",
    "answer": ["...", "-.--", "-.--", ".-.", "-.", "-.--", ".-.", ".-.-", ".", "-"],
    "score": 100
  },
  {
    "id": 27,
    "description": "Над бедным котом просто издеваются. Сначала буква Ы, а теперь и Й. Я так отказываюсь работать! Ладно, вдох-выдох... Выдам хотя бы интересный факт: вы знали, что правильное ударение в слове йогурт, это йогУрт, а не йОгурт. Вот такая скудная у меня на сей раз реплика, но я котик и у меня лапки, а значит с меня взятки гладки! Вперед - выполни упражнение и я буду очень счастлив :) Не забудь заполнить все поля!",
    "symbols": ["й"],
    "code": [".---"],
    "task": "твоййогурт",
    "answer": ["-", ".--", "---", ".---", ".---", "---", "--.", "..-", ".-.", "-"],
    "score": 100
  },
  {
    "id": 28,
    "description": "Теперь мы изучим нечто настолько же мягкое, как и моя шерстка. Догадались? Да это товарищ мягкий знак!. Ну судя по количеству символов, он не так уж и мягок. Мы уже на финишной прямой - поэтому выполни упражнение, и мы пойдем дальше - прямо к финишу, где ты официально станешь экспертом азбуки Мурзе. Не забывай, что выполненное упражнение = проверенное упражнение. На проверку оно отправляется автоматически, но для этого нужно заполнить все поля. Ты уже почти эксперт, так что напоминать про символы не буду :)",
    "symbols": ["ь"],
    "code": ["-..-"],
    "task": "весььлезьь",
    "answer": [".--", ".", "...", "-..-", "-..-", ".-..", ".", "--..", "-..-", "-..-"],
    "score": 100
  },
  {
    "id": 29,
    "description": "Скажи, что общего между Юджином Крабсом и юностью? Нет, я не смотрел Спанч Боба, когда был юн, и вообще хватит тут шутить! Общее, конечно, это буква Ю. Выполни упражнение, и тогда может быть я расскажу тебе про свои юные годы, когда я был совсем котеночком... Верю, что правила для тебя не секрет, но если ты еще не знаешь секрета - глянь любой другой урок. Да, я ленивый :) Для котика это простительно!",
    "symbols": ["ю"],
    "code": ["..--"],
    "task": "юныйвьюнюлилюлу",
    "answer": [
      "..--",
      "-.",
      "-.--",
      ".---",
      ".--",
      "-..-",
      "..--",
      "-.",
      "..--",
      ".-..",
      "..",
      ".-..",
      "..--",
      ".-..",
      "..-"
    ],
    "score": 100
  },
  {
    "id": 30,
    "description": "Однажды Эрнест Хемингуэй поспорил, что сможет написать самый короткий рассказ, способный растрогать любого. Он написал: \"Это предпоследний урок текстового тренажера\". Плакала вся маршрутка... А ты не плачь, а лучше выполни упражнение (и не забывай про необходимость заполнить нашими хорошими знакомыми \".\" точками и \"-\" тире (минусами) все поля) :)",
    "symbols": ["э"],
    "code": ["..-.."],
    "task": "этаэрасэра",
    "answer": ["..-..", "-", ".-", "..-..", ".-.", ".-", "...", "..-..", ".-.", ".-"],
    "score": 100
  },
  {
    "id": 31,
    "description": "Последний бой он трудный самый, и драться тебе предстоит с твердым знаком. Он, как ты знаешь, тверд и непоколебим, так что будь осторожен. Покажи мне, твоему верному товарищу, чему ты научился. Эх, совсем умненький стал... Нет, я не плачу, это просто колбаса в глаз попала...",
    "symbols": ["ъ"],
    "code": [".--.-."],
    "task": "съелъмъелъ",
    "answer": ["...", ".--.-.", ".", ".-..", ".--.-.", "--", ".--.-.", ".", ".-..", ".--.-."],
    "score": 100
  }
]
